2021-11-07-entr.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>entr</title>
<meta name="generator" content="Org mode" />
<meta name="keywords" content="emacs,test" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">entr
<br />
<span class="subtitle">Run arbitrary commands when files change</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64bdb9a">My use case</a></li>
<li><a href="#org64d3153">References</a></li>
</ul>
</div>
</div>
<div class="date">
<p>
07 Nov 2021 Wed
</p>

</div>

<p>
Long ago, I came across a tool called <a href="http://eradman.com/entrproject/">entr</a>, and it's a pretty cool program actually.
What it does is really simple, but yet powerful, it let you run any arbitrary set of commands when a specific files changes.<br />
</p>

<p>
The <a href="http://eradman.com/entrproject/">entr's website</a> has a great explanation for it with a bunch of great examples to start with.<br />
But long story short, you pass a set of files (using regex for example) to the command through <code>stdin</code>, and then make it run
a script or a command whenever one of these file changes.<br />
For example, here I make it monitor any <code>markdown</code> files in my current directory, and execute a script that commit and pushes the changes
i made automatically.
</p>
<div class="org-src-container">
<pre class="src src-sh">find -iname <span style="font-style: italic;">"*.md"</span> | entr commit-and-push.sh
</pre>
</div>
<div id="outline-container-org64bdb9a" class="outline-2">
<h2 id="org64bdb9a">My use case</h2>
<div class="outline-text-2" id="text-org64bdb9a">
<p>
I can think of numerous use cases and scenarios in which this utility may be quite useful, but for the time being,
I'm integrating it into my blog writing workflow.
</p>

<div class="note">
<p>
<a href="https://orgmode.org/">org mode</a> is a markdown language and a major mode for Emacs
</p>

</div>

<p>
Before i publish any blog online, I use a small local web server to see the output result locally .
Of course I use Emacs and <a href="https://orgmode.org/">org mode</a> to create my own blog posts, and I use another Emacs package called 
<a href="https://github.com/skeeto/emacs-web-server">simple-httpd</a> to create a simple web server &#x2014; as the name implies! &#x2014; .
</p>

<p>
The issue I was having was that I had to rebuild the <code>html</code> files from the <code>org</code> files every time I wanted to see the output.
I wrote a simple shell script to accomplish this, but still, you need to run it manually.
</p>

<p>
You can see now how <b>entr</b> can fits into this workflow.
Why don't I use <b>entr</b> to monitor my <code>org</code> files and make it run the <code>build.sh</code> script whenever I make a change 😀?
</p>

<div class="org-src-container">
<pre class="src src-sh">find . -iname <span style="font-style: italic;">"*.org"</span> | entr ./build.sh
</pre>
</div>

<p>
And that's it, it's that simple.<br />
All I have to do now is to write my posts, save them, and then reload the web page to see the results.<br />
Wonderful.
</p>
</div>
</div>

<div id="outline-container-org64d3153" class="outline-2">
<h2 id="org64d3153">References</h2>
<div class="outline-text-2" id="text-org64d3153">
<ul class="org-ul">
<li><a href="https://github.com/skeeto/emacs-web-server">simple-httpd GitHub repo</a></li>
<li><a href="http://eradman.com/entrproject/">entr(1)</a></li>
<li><a href="https://jvns.ca/blog/2020/06/28/entr/">Julia Evans's blog post on entr</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 07 Nov 2021 Wed</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
